driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilNested/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <typ:item xmlns:typ="http://j2ee.netbeans.org/wsdl/RepeatUntilNested/types">
      <value>Test Repeat Until Nested Output OUTERINNERINNEROUTERINNERINNER</value>
    </typ:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>