driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/RepeatUntilNested/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://j2ee.netbeans.org/wsdl/RepeatUntilNested/types">
  <soapenv:Body>
    <typ:item>
      <value>Test Repeat Until Nested Output </value>
    </typ:item>
  </soapenv:Body>
</soapenv:Envelope>