driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/results/RepeatUntilNested/Actual_20130325125246_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <typ:item xmlns:msgns="http://j2ee.netbeans.org/wsdl/RepeatUntilNested" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://j2ee.netbeans.org/wsdl/RepeatUntilNested/types">
      <value>Test Repeat Until Nested Output OUTERINNERINNEROUTERINNERINNER</value>
    </typ:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>